## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/11047072163)



<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * github_actions_variable.kyma_autobump_bot_github_token_secret_name
* Update
  * google_service_account.sa-gke-kyma-integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.kyma_autobump_bot_github_token_secret_name will be created
  + resource "github_actions_variable" "kyma_autobump_bot_github_token_secret_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "kyma-project/test-infra"
      + updated_at    = (known after apply)
      + value         = "workloads_default_kyma-autobump-bot-github-token"
      + variable_name = "KYMA_AUTOBUMP_BOT_GITHUB_SECRET_NAME"
    }

  # google_service_account.sa-gke-kyma-integration will be updated in-place
  ~ resource "google_service_account" "sa-gke-kyma-integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE." -> "Service account is used by Prow to integrate with GKE. Will be removed with Prow"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11983,"Program":"tfcmt","SHA1":"540fd9241c7ce4b3d2ed6f0d028075b620aff3db","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->